Repository: tyler-lawrence/HexHunter
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar

source: in the displayed color.
ar: في اللون المعروض.

source: (Character1 * 16) + Character2
ar: (الحرف الأول * 16) + الحرف الثاني

source: A hexcode is a hexadecimal representation of a color. You may have seen a color picking tool request a number from 0 to 255. Let's explore how we can convert something like #%@ to the 0-255 scale.
ar: الرمز الهيكساديمل هو تمثيل سداسي عشري للون. ربما رأيت أداة اختيار الألوان تطلب رقمًا من 0 إلى 255. دعونا نستكشف كيف يمكننا تحويل شيء مثل #%@ إلى المقياس من 0 إلى 255.

source: Accuracy: %@
ar: دقة: %@

source: Accuracy: %@%%
ar: دقة: %@%

source: Adjust the sliders below so your hexcode matches the target hexcode:
ar: اضبط أشرطة التمرير أدناه بحيث يتطابق رمز الهيكس الخاص بك مع رمز الهيكس الهدف:

source: Are you sure you want to leave?
ar: هل انت متاكد انك تريد ان تغادر

source: Are you sure?
ar: هل أنت متأكد؟

source: Average score: %@
ar: متوسط النتيجة: %@

source: B
ar: ب

source: B: %lld
ar: ب: %lld

source: Back
ar: خلف

source: Begin
ar: يبدأ

source: blue
ar: أزرق

source: Blue = (11 * 16) + 0 = 176
ar: أزرق = (11 * 16) + 0 = 176

# Blue = %@ / 255 = %@
source: Blue = %1$@ / 255 = %2$@
ar: أزرق = %1$@ / 255 = %2$@

# Blue = |%@ - %@| = %@
source: Blue = |%1$@ - %2$@| = %3$@
ar: أزرق = |%1$@ - %2$@| = %3$@

# Blue: %@ = %@
source: Blue: %1$@ = %2$@
ar: أزرق: %1$@ = %2$@

source: Category
ar: فئة

source: Changing the color components
ar: تغيير مكون اللون

source: Check your network connection
ar: تحقق من اتصال الشبكة الخاصة بك

source: Color of the Day
ar: لون اليوم

source: Color of the Day Stats
ar: لون اليوم إحصائيات

source: Current rank:
ar: الرتبة الحالية:

source: Date
ar: تاريخ

source: Example
ar: مثال

source: Exit
ar: مخرج

source: Finally, we take the average of the three similarity measures and multiply that by 100 to calculate our final score
ar: أخيراً ، نقوم بأخذ متوسط أرقام مقياس التشابة و ضربهم على 100 للحصول على النتيجة النهائية

source: Following the formula from above we get
ar: اتباعاً للصيغة السابقة نحصل على :

source: G
ar: ز

source: G: %lld
ar: ز: %lld

source: green
ar: أخضر

source: Green = (10 * 16) + 0 = 160
ar: أخضر = (10 * 16) + 0 = 160

# Green = %@ / 255 = %@
source: Green = %1$@ / 255 = %2$@
ar: أخضر = %1$@ + 255 = %2$@

# Green = |%@ - %@| = %@
source: Green = |%1$@ - %2$@| = %3$@
ar: أخضر = |%@ - %@| = %@

# Green: %@ = %@
source: Green: %1$@ = %2$@
ar: أخضر: %@ = %@

source: Guess
ar: يخمن

source: Hexcode: #%@
ar: الرمز السداسي: #%@

source: Leaderboards
ar: المتصدرين

source: Let's get started by learning the basics of hexcodes
ar: لنبدأ بتعلم أساسيات رموز الهيكس

source: Let's take a look at the color
ar: لنلقي نظرة على اللون

source: Loading...
ar: تحميل...

source: Mode
ar: وضع

source: Move the slider to increase or decrease the amount of color present
ar: حرك الشريط لزيادة أو تقليل كمية اللون الموجود.

source: Next
ar: التالي

source: No
ar: لا

source: No Scores
ar: لا عشرات

source: Ok
ar: نعم

source: Play again
ar: العب مرة أخرى

source: Practice
ar: ممارسة

source: R
ar: ر

source: R adjusts the red component, G adjusts the green component, and B adjusts the blue component.
ar: ر يُعدل المكون الأحمر, ز يُعدل المكون الأخضر, ب يعدل المكون الأزرق

source: R: %lld
ar: ر: %lld

source: red
ar: أحمر

source: Red = (2 * 16) + 0 = 32
ar: أحمر = (2 * 16) + 0 = 32

# Red = %@ / 255 = %@
source: Red = %1$@ / 255 = %2$@
ar: أحمر = %1$@ / 255 = %2$@

# Red = |%@ - %@| = %@
source: Red = |%1$@ - %2$@| = %3$@
ar: أحمر = |%@ - %@| = %@

# Red: %@ = %@
source: Red: %1$@ = %2$@
ar: أحمر: %@ = %@

source: Red: %lld
ar: أحمر: %lld

source: Reveal
ar: يكشف

source: Sandbox
ar: صندوق الرمل

source: Score
ar: النتيجة

source: Score: %@
ar: النتيجة: %@

source: Score: %lld
ar: النتيجة: %lld

source: Scores are calculated by measuring the difference between each component. Each component (red, green, and blue) can be handled as a number between 0 and 255.
ar: النتائج يتم حسابها عن طريق قياس الفارق بين كل مُكَون . كل مُكون ( أحمر ، أخضر ، أزرق ) يتم التعامل معه على أنه رقم ما بين 0 و 255

source: Scores range from 0 to 100. Higher scores are better. See if you can get a perfect 100!
ar: نطاق النتيجة من 0 إلى 100 . كلما كانت النتيجة أعلى يصبح أفضل . لنرى إن كنت تستطيع الحصول على 100 كاملة !

source: Skip
ar: يتخطى

source: Sometimes you also see alpha attached to a hexcode. Alpha represents the opacity of a color.
ar: بعض الأحيان سترى أيضاً حروف مُدرجة في رمز الهكس . الحروف تُمثل عتمة اللون .

source: Sort
ar: فرز

source: start guessing
ar: ابدأ بالتخمين

source: Survival
ar: نجاة

source: Target
ar: هدف

source: Target: #%@
ar: هدف: # %@

source: Target: %@
ar: هدف: %@

source: test
ar: امتحان

source: The first two characters represent
ar: الحرفان الأولان يمثلان

source: The scale goes from 00 to FF. The letters are introduced when we would get to double digit numbers. 10 becomes A, 11 becomes B, 12 becomes C, etc. The first number is a large scale change and the second character is finer detail
ar: ينتقل المقياس من 00 إلى FF . يتم تقديم الحروف عندما نصل إلى أرقام مزدوجة . 10 يصبح A ، و ال 11 يصبح B ، وال ١٢ يصبح C الخ .الحرف الأول هو توسيع النطاق والثاني لتفاصيل أدق

source: The second two characters represent
ar: الحرفان في المجموعة الثانية يمثلان

source: The third two characters represent
ar: المجموعة الثالثة من الأحرف

source: The top slider controls large change. The bottom slider controls finer detail
ar: الشريط العلوي يتحكم في التغيير الكبير. الشريط السفلي يتحكم في التفاصيل الدقيقة.

source: Then we divide those differences by 255 to get a similarity measure.
ar: بعد ذلك نقوم بقسمة ناتج الطرح أو الرقم الفارق على 255 للحصول على مقياس التشابه

source: To calculate the score we take the absolute difference of each component.
ar: لحساب النتيجة نأخذ فرق القيمة المطلقة لكل لون

source: To convert the hexcode to a number you first convert the digit to its corresponding numeric value (if necessary) and apply the following formula:
ar: لتحويل رمز الهكس إلى رقم ، نقوم أول بتحويل الرقم إلى قيمته الرقمية المقابلة (إذا لزم الأمر) وتطبيق الصيغة التالية :

source: Total games played: %lld
ar: إجمالي الألعاب التي تم لعبها:%lld

source: Use the sliders below to increase or decrease the amount of
ar: استخدم أشرطة التمرير أدناه لزيادة أو تقليل كمية

source: Welcome to HexHunter
ar: مرحبا بك في هكس هنتر

source: Yes
ar: نعم

source: Yes!
ar: نعم!

source: Your Color
ar: لونك

source: Your guess
ar: تخمينك

source: Your Guess
ar: تخمينك

source: Your guess: %@
ar: تخمينك: %@
